Revit 2024 API
InstanceVoidCutUtils.InstanceVoidCutExists Method
 Check whether the instance is cutting the element
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static bool InstanceVoidCutExists(
	Element element,
	Element cuttingInstance
)
Visual Basic
Public Shared Function InstanceVoidCutExists ( _
	element As Element, _
	cuttingInstance As Element _
) As Boolean
Visual C++
public:
static bool InstanceVoidCutExists(
	Element^ element,
	Element^ cuttingInstance
)
Parameters
element
Type: Autodesk.Revit.DB.Element
 The element being cut
cuttingInstance
Type: Autodesk.Revit.DB.Element
 The cutting family instance
Return Value
 Returns true if the instance is cutting the element.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
InstanceVoidCutUtils Class
Autodesk.Revit.DB Namespace